12/data/attachments/e27f06b8c2a08080.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Caleb_above_Friend_5549_5</nif:username>
            <nif:friendToBeRequested>soap_friends_b7f4e6c3-6c53-40f1-a19a-ae8fcadefb5c</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>